def distance(a, b, c):
    objectheight={'Піхотинець':1.7,
            'Танк':2.7,
            'БМП':2.2,
            'БТР':2,
            'Кулеметний розрахунок':0,
            'Вантажний автомобіль':2.5,
            'Пасажирський вагон чотиривісний':4,
            'Деревяний стовп лінії звязку':6,
            'Відстань між стовпами лінії звязку':0,}
    objectwidth={'Піхотинець':0.5,
            'Танк':3,
            'БМП':2.5,
            'БТР':2.4,
            'Кулеметний розрахунок':1,
            'Вантажний автомобіль':3.5,
            'Пасажирський вагон чотиривісний':3,
            'Деревяний стовп лінії звязку':0,
            'Відстань між стовпами лінії звязку':50,}
    heightwidth=b
    objec=c
    if a==('висота'):
        print(objectheight[objec]*10/heightwidth*5)
    elif a==('ширина'):
        print(objectwidth[objec]*10/heightwidth*5)
    else:
        print('Я вас не розумію')