writers=['Тарас Григорович Шевченко''Іван Якович Франко''Рильський Максим Тадейович''Всеволод Зінов́ійович Нестайко']

datebirth={'Тарас Григорович Шевченко':'25.02.1814', 'Іван Якович Франко':'27.08.1856', 'Рильський Максим Тадейович':'24.07.1964', 'Всеволод Зінов́ійович Нестайко':'30.01.1930'}
cityvillage={'Тарас Григорович Шевченко':'Моринці', 'Іван Якович Франко':'Нагуєвичі', 'Рильський Максим Тадейович':'Київ', 'Всеволод Зінов́ійович Нестайко':'Бердичів'}
region={'Тарас Григорович Шевченко':'Київська', 'Іван Якович Франко':'Львівська', 'Рильський Максим Тадейович':'Київська', 'Всеволод Зінов́ійович Нестайко':' Житомирська'}

