writers=['Тарас Григорович Шевченко', 'Іван Якович Франко', 'Рильський Максим Тадейович', 'Всеволод Зінов́ійович Нестайко']

birthday={'Тарас Григорович Шевченко':'25.02.1814', 'Іван Якович Франко':'27.08.1856', 'Рильський Максим Тадейович':'24.07.1964', 'Всеволод Зінов́ійович Нестайко':'30.01.1930'}
cityvillage={'Тарас Григорович Шевченко':'с.Моринці', 'Іван Якович Франко':'с.Нагуєвичі', 'Рильський Максим Тадейович':'м.Київ', 'Всеволод Зінов́ійович Нестайко':'м.Бердичів'}
region={'Тарас Григорович Шевченко':'Київська', 'Іван Якович Франко':'Львівська', 'Рильський Максим Тадейович':'Київська', 'Всеволод Зінов́ійович Нестайко':' Житомирська'}


def GetAllWriters():
    idx=1
    for writer in writers:
        print('{0}.{1}'.format(idx, writer))
        idx+=1
def GetBirthday(writer):
    print (birthday[writer])
    
def GetPlaceOfBirth(writer):
    print('Письменик народився в {0} {1} обл.'.format(cityvillage[writer],region[writer]))

