#!/usr/bin/python3
print('Привітайтесь')
text=input()
print('Привіт, як вас звати.')
name=input()
print('Привіт, '+name+'!')
print('Приємно познайомитись '+ name)
print('Я не маю імені, але ви можете мені його придумати.')
name2=input()
print('Тепер мене звати '+name2)
print('________________________________________________')
print('Який вид спорту ваш улюблений вид спорту.')
sport=input()
if(sport=='Футбол'):
    print('Цікаво, а ви знали що Футбол найвідоміший вид спорту.')
elif(sport=='Баскетбол'):    
    print('Мені теж подобаєтся Баскетбол')
elif(sport=='Волейбол'):
    print('Волейбол мені не дуже подобаєтся')
else:
    print('Я не знаю такого виду спорту, або ви неправільно написали слово:)')
print('___________________________________________________________________________')
print('Який ваш рік народження')
year=int(input())
print('___________________________________________________________________________')
print('Яка ваша область')
cyti=input()
print('___________________________________________________________________________')
print('Яке ваше село, або місто')
village=input()
print('___________________________________________________________________________')
print('Ваша анкета')
print('___________________________________________________________________________')
print(name)
print('Улюблений вид спорту '+sport)
print(2020-year)
print('Ваша область '+cyti)
print('Ваше село, або місто '+village)
print('___________________________________________________________________________')









    
    


    