#          Лекція: Основи словників в Python

#Словники - це потужний інструмент для організації та зберігання даних,
#особливо коли потрібно швидко доступатися до значень за їхніми ключами.
#Навчайтесь використовувати їх у своїх програмах, 
#і вони стануть важливою частиною вашого розробницького досвіду.

#1. Створення словника
   #Для створення словника використовуйте фігурні дужки {} або конструктор dict():

my_dict = {}  # Порожній словник
person = {
    "ім'я": "Іван",
    "вік": 30,
    "місто": "Київ"
}  # Словник із ключами та значеннями

#2. Додавання та оновлення значень
   #Для додавання нового ключа та значення в словник або оновлення існуючого, просто присвойте значення ключу:

person["стать"] = "чоловіча"  # Додавання нового ключа та значення
person["вік"] = 31  # Оновлення значення існуючого ключа


#3. Доступ до значень 
  # Для отримання значення за ключем використовуйте квадратні дужки та ключ:

name = person["ім'я"]  # Отримання значення за ключем

#4. Перевірка наявності ключа
   #Перевірка чи існує ключ в словнику можлива за допомогою оператора in:

if "стать" in person:
    print("Ключ 'стать' існує в словнику.")

#5. Видалення ключа та значення
   #Для видалення ключа та його значення використовуйте оператор del:

del person["місто"]  # Видалення ключа та значення


#6. Отримання всіх ключів та значень
  # Можна отримати всі ключі та значення словника за допомогою методів keys() і values():

keys = person.keys()  # Отримання всіх ключів
values = person.values()  # Отримання всіх значень


#7. Ітерація по словнику
  # Ітерація (перебір) по словнику можлива за допомогою циклу for:

for key, value in person.items():
    print(f"{key}: {value}")

#--------------------Приклад примітивної бази даних на основі словників ---------------

# Міша -   14
# Саша -   13
# Віра -   4
# Андрій - 7

# Міша -   2008
# Саша -   2009
# Віра -   2019
# Андрій - 2016

# Міша -   misha@gmail.com
# Саша -   sasha@gmail.com
# Віра -   visha@gmail.com
# Андрій - andrii@gmail.com

list = {'Misha', 'Sasha', 'Vira', 'Andrii'}
dict_years = {'Misha':2008, 'Sasha':2009, 'Vira':2019, 'Andrii':2016}
print(dict_years['Misha'])
print(dict_years['Vira'])
dict_emails = {'Misha':'misha@gmail.com', 'Sasha':'sasha@gmail.com', 'Vira':'visha@gmail.com', 'Andrii':'andrii@gmail.com'}

print('емейл Саши ' + dict_emails['Sasha'])
print('рік народження Саши {}'.format(dict_years['Sasha']))

# скопонуємо все в окремий метод, який з усіх словників витягне інформацію за ключем
# в даному випадку ключем є імя людини
# приклад примітивної бази даних.
def GetInfo(name):
    result = "info about " + name + ": "
    result += "email:" + dict_emails[name] + " "
    result += "year:" + str(dict_years[name]) + " "
    return result

print(GetInfo('Vira'))
